sorosaulong-ux/gd32-test-project/Library/gd32a7xx_ioc.h
/*!
    \file    gd32a7xx_ioc.h
    \brief   definitions for the IOC

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_IOC_H
#define GD32A7XX_IOC_H

#include "gd32a7xx.h"

/* IOC base definition*/
#define IOC                                     IOC_BASE                                        /*!< IOC base address */

/* registers definitions */
#define IOC_CTL                                 REG32(IOC + 0x00000000U)                        /*!< control register */
#define IOC_RSTSTATC                            REG32(IOC + 0x00000004U)                        /*!< reset status clear register */
#define IOC_RST0                                REG32(IOC + 0x00000008U)                        /*!< reset register 0 */
#define IOC_RST1                                REG32(IOC + 0x0000000CU)                        /*!< reset register 1 */
#define IOC_RFPMESTAT                           REG32(IOC + 0x00000018U)                        /*!< reference signal FPMx edge status register */
#define IOC_MFPMESTAT                           REG32(IOC + 0x0000001CU)                        /*!< monitor signal FPMx edge status register */
#define IOC_FPMCFG(fpmx)                        REG32(IOC + 0x00000020U + (fpmx)*4U)            /*!< FPMx configuration register */
#define IOC_RFPMCNT(fpmx)                       REG32(IOC + 0x00000040U + (fpmx)*4U)           /*!< reference signal FPMx count register */
#define IOC_MFPMCNT(fpmx)                       REG32(IOC + 0x00000060U + (fpmx)*4U)           /*!< monitor signal FPMx count register */
#define IOC_RICTL                               REG32(IOC + 0x00000080U)                        /*!< RSG combiner reference signal input control register */
#define IOC_EGMCNT(egmx)                        REG32(IOC + 0x00000084U + (egmx)*4U)            /*!< EGMx count register */
#define IOC_EGMCTL(egmx)                        REG32(IOC + 0x000000A4U + (egmx)*4U)            /*!< EGMx control register */
#define IOC_EGMCFG(egmx)                        REG32(IOC + 0x000000C4U + (egmx)*4U)            /*!< EGMx configuration register */
#define IOC_SEGMCTL0                            REG32(IOC + 0x000000E4U)                        /*!< SEGM control register 0 */
#define IOC_SEGMCTL1                            REG32(IOC + 0x000000E8U)                        /*!< SEGM control register 1 */
#define IOC_SEGMTER0                            REG32(IOC + 0x000000ECU)                        /*!< SEGM generation event record register0 */
#define IOC_SEGMTER1                            REG32(IOC + 0x000000F0U)                        /*!< SEGM generation event record register1 */
#define IOC_TMRINTSTAT                          REG32(IOC + 0x000000F4U)                        /*!< TMR interrupt and status register */
#define IOC_INTSTAT                             REG32(IOC + 0x000000F8U)                        /*!< interrupt and status register */

/* fields definitions */
/* IOC_CTL */
#define IOC_CTL_IOCEN                           BIT(0)                                          /*!< IOC enable */
#define IOC_CTL_IOCENF                          BIT(1)                                          /*!< IOC status */
#define IOC_CTL_CLKEN                           BIT(3)                                          /*!< clock enable */
#define IOC_CTL_PSC                             BITS(8,15)                                      /*!< clock prescaler selection */

/* IOC_RSTSTATC */
#define IOC_RSTSTATC_RSTFC                      BIT(0)                                          /*!< clear reset flag */

/* IOC_RST0 */
#define IOC_RST0_RST0                           BIT(0)                                          /*!< reset IOC */

/* IOC_RST1 */
#define IOC_RST1_RST1                           BIT(0)                                          /*!< reset IOC */
#define IOC_RST1_RSTF                           BIT(1)                                          /*!< IOC reset flag */

/* IOC_RFPMESTAT */
#define IOC_RFPMESTAT_FPM0FEF                   BIT(0)                                          /*!< reference signal FPM0 falling edge flag */
#define IOC_RFPMESTAT_FPM1FEF                   BIT(1)                                          /*!< reference signal FPM1 falling edge flag */
#define IOC_RFPMESTAT_FPM2FEF                   BIT(2)                                          /*!< reference signal FPM2 falling edge flag */
#define IOC_RFPMESTAT_FPM3FEF                   BIT(3)                                          /*!< reference signal FPM3 falling edge flag */
#define IOC_RFPMESTAT_FPM4FEF                   BIT(4)                                          /*!< reference signal FPM4 falling edge flag */
#define IOC_RFPMESTAT_FPM5FEF                   BIT(5)                                          /*!< reference signal FPM5 falling edge flag */
#define IOC_RFPMESTAT_FPM6FEF                   BIT(6)                                          /*!< reference signal FPM6 falling edge flag */
#define IOC_RFPMESTAT_FPM7FEF                   BIT(7)                                          /*!< reference signal FPM7 falling edge flag */
#define IOC_RFPMESTAT_FPM0REF                   BIT(16)                                         /*!< reference signal FPM0 rising edge flag */
#define IOC_RFPMESTAT_FPM1REF                   BIT(17)                                         /*!< reference signal FPM1 rising edge flag */
#define IOC_RFPMESTAT_FPM2REF                   BIT(18)                                         /*!< reference signal FPM2 rising edge flag */
#define IOC_RFPMESTAT_FPM3REF                   BIT(19)                                         /*!< reference signal FPM3 rising edge flag */
#define IOC_RFPMESTAT_FPM4REF                   BIT(20)                                         /*!< reference signal FPM4 rising edge flag */
#define IOC_RFPMESTAT_FPM5REF                   BIT(21)                                         /*!< reference signal FPM5 rising edge flag */
#define IOC_RFPMESTAT_FPM6REF                   BIT(22)                                         /*!< reference signal FPM6 rising edge flag */
#define IOC_RFPMESTAT_FPM7REF                   BIT(23)                                         /*!< reference signal FPM7 rising edge flag */

/* IOC_MFPMESTAT */
#define IOC_MFPMESTAT_FPM0FEF                   BIT(0)                                          /*!< monitor signal FPM0 falling edge flag */
#define IOC_MFPMESTAT_FPM1FEF                   BIT(1)                                          /*!< monitor signal FPM1 falling edge flag */
#define IOC_MFPMESTAT_FPM2FEF                   BIT(2)                                          /*!< monitor signal FPM2 falling edge flag */
#define IOC_MFPMESTAT_FPM3FEF                   BIT(3)                                          /*!< monitor signal FPM3 falling edge flag */
#define IOC_MFPMESTAT_FPM4FEF                   BIT(4)                                          /*!< monitor signal FPM4 falling edge flag */
#define IOC_MFPMESTAT_FPM5FEF                   BIT(5)                                          /*!< monitor signal FPM5 falling edge flag */
#define IOC_MFPMESTAT_FPM6FEF                   BIT(6)                                          /*!< monitor signal FPM6 falling edge flag */
#define IOC_MFPMESTAT_FPM7FEF                   BIT(7)                                          /*!< monitor signal FPM7 falling edge flag */
#define IOC_MFPMESTAT_FPM0REF                   BIT(16)                                         /*!< monitor signal FPM0 rising edge flag */
#define IOC_MFPMESTAT_FPM1REF                   BIT(17)                                         /*!< monitor signal FPM1 rising edge flag */
#define IOC_MFPMESTAT_FPM2REF                   BIT(18)                                         /*!< monitor signal FPM2 rising edge flag */
#define IOC_MFPMESTAT_FPM3REF                   BIT(19)                                         /*!< monitor signal FPM3 rising edge flag */
#define IOC_MFPMESTAT_FPM4REF                   BIT(20)                                         /*!< monitor signal FPM4 rising edge flag */
#define IOC_MFPMESTAT_FPM5REF                   BIT(21)                                         /*!< monitor signal FPM5 rising edge flag */
#define IOC_MFPMESTAT_FPM6REF                   BIT(22)                                         /*!< monitor signal FPM6 rising edge flag */
#define IOC_MFPMESTAT_FPM7REF                   BIT(23)                                         /*!< monitor signal FPM7 rising edge flag */

/* IOC_FPMx_CFG */
#define IOC_FPMX_CFG_CMP                        BITS(0,15)                                      /*!< the value of 16 bit comparator*/
#define IOC_FPMX_CFG_MSEL                       BITS(16,18)                                     /*!< FPM mode*/
#define IOC_FPMX_CFG_MISEL                      BITS(19,20)                                     /*!< monitor input signal selection*/
#define IOC_FPMX_CFG_RCNT                       BIT(22)                                         /*!< reset the counter of timer*/
#define IOC_FPMX_CFG_RISEL                      BITS(24,26)                                     /*!< reference input signal selection*/

