sorosaulong-ux/gd32-test-project/Library/gd32a7xx_ioc.h
/* IOC_RFPMxCNT */
#define IOC_RFPMXCNT_CNT                        BITS(0,15)                                      /*!< the value of the reference signal FPM timer counter*/

/* IOC_MFPMxCNT */
#define IOC_MFPMxCNT_CNT                        BITS(0,15)                                      /*!< the value of the monitor signal FPM timer counter*/

/* IOC_RICTL */
#define IOC_RICTL_TIEEN0                        BIT(0)                                          /*!< TRIGGSEL input 0 selection for RSG combiner*/
#define IOC_RICTL_TIEEN1                        BIT(1)                                          /*!< TRIGGSEL input 1 selection for RSG combiner*/
#define IOC_RICTL_TIEEN2                        BIT(2)                                          /*!< TRIGGSEL input 2 selection for RSG combiner*/
#define IOC_RICTL_TIEEN3                        BIT(3)                                          /*!< TRIGGSEL input 3 selection for RSG combiner*/
#define IOC_RICTL_TIEEN4                        BIT(4)                                          /*!< TRIGGSEL input 4 selection for RSG combiner*/
#define IOC_RICTL_TIEEN5                        BIT(5)                                          /*!< TRIGGSEL input 5 selection for RSG combiner*/
#define IOC_RICTL_TIEEN6                        BIT(6)                                          /*!< TRIGGSEL input 6 selection for RSG combiner*/
#define IOC_RICTL_TIEEN7                        BIT(7)                                          /*!< TRIGGSEL input 7 selection for RSG combiner*/

/* IOC_EGMxCNT */
#define IOC_EGMXCNT_CNT                         BITS(0,23)                                      /*!< The value of event window count*/
#define IOC_EGMXCNT_CNTOVF                      BIT(31)                                         /*!< Overflow flag*/

/* IOC_EGMxCTL */
#define IOC_EGMXCTL_INVREN                      BIT(0)                                          /*!< enable invert reference signal*/
#define IOC_EGMXCTL_INVMEN                      BIT(1)                                          /*!< enable invert monitor signal*/
#define IOC_EGMXCTL_MREN                        BIT(2)                                          /*!< enable monitor signal from the FPM compared with reference signal*/
#define IOC_EGMXCTL_EWGRM                       BIT(3)                                          /*!< event window generation run mode*/
#define IOC_EGMXCTL_EWGSIGS                     BIT(4)                                          /*!< event window generation signal selection*/
#define IOC_EGMXCTL_EVDIS                       BIT(5)                                          /*!< Disable event generated*/
#define IOC_EGMXCTL_EWAES                       BITS(8,11)                                      /*!< event window triger edge selection*/
#define IOC_EGMXCTL_INVEWEN                     BIT(12)                                         /*!< invert event window*/
#define IOC_EGMXCTL_MONSIGS                     BITS(16,18)                                     /*!< monitor signal selection*/
#define IOC_EGMXCTL_REFSIGS                     BITS(20,22)                                     /*!< reference signal selection*/

/* IOC_EGMxCFG */
#define IOC_EGMXCFG_EWCTH                       BITS(0,23)                                      /*!< event window count threshold*/

/* IOC_SEGMCTL0 */
#define IOC_SEGMCTL0_CH0ES                      BITS(0,2)                                       /*!< SEGM channel 0 event selection*/
#define IOC_SEGMCTL0_CH0THR                     BITS(4,7)                                       /*!< SEGM Channel 0 event counter threshold*/
#define IOC_SEGMCTL0_CH1ES                      BITS(8,10)                                      /*!< SEGM channel 1 event selection*/
#define IOC_SEGMCTL0_CH1THR                     BITS(12,15)                                     /*!< SEGM Channel 1 event counter threshold*/
#define IOC_SEGMCTL0_CH2ES                      BITS(16,18)                                     /*!< SEGM channel 2 event selection*/
#define IOC_SEGMCTL0_CH2THR                     BITS(20,23)                                     /*!< SEGM Channel 2 event counter threshold*/
#define IOC_SEGMCTL0_CH3ES                      BITS(24,26)                                     /*!< SEGM channel 3 event selection*/
#define IOC_SEGMCTL0_CH3THR                     BITS(28,31)                                     /*!< SEGM Channel 3 event counter threshold*/

/* IOC_SEGMCTL1 */
#define IOC_SEGMCTL1_EGM_ETM0EN                 BIT(0)                                          /*!< enable EGM_ETM0 selection*/
#define IOC_SEGMCTL1_EGM_ETM1EN                 BIT(1)                                          /*!< enable EGM_ETM1 selection*/
#define IOC_SEGMCTL1_EGM_ETM2EN                 BIT(2)                                          /*!< enable EGM_ETM2 selection*/
#define IOC_SEGMCTL1_EGM_ETM3EN                 BIT(3)                                          /*!< enable EGM_ETM3 selection*/
#define IOC_SEGMCTL1_EGM_ETM4EN                 BIT(4)                                          /*!< enable EGM_ETM4 selection*/
#define IOC_SEGMCTL1_EGM_ETM5EN                 BIT(5)                                          /*!< enable EGM_ETM5 selection*/
#define IOC_SEGMCTL1_EGM_ETM6EN                 BIT(6)                                          /*!< enable EGM_ETM6 selection*/
#define IOC_SEGMCTL1_EGM_ETM7EN                 BIT(7)                                          /*!< enable EGM_ETM7 selection*/
#define IOC_SEGMCTL1_SEGM_CH0EN                 BIT(16)                                         /*!< enable SEGM channel 0 selection*/
#define IOC_SEGMCTL1_SEGM_CH1EN                 BIT(17)                                         /*!< enable SEGM channel 1 selection*/
#define IOC_SEGMCTL1_SEGM_CH2EN                 BIT(18)                                         /*!< enable SEGM channel 2 selection*/
#define IOC_SEGMCTL1_SEGM_CH3EN                 BIT(19)                                         /*!< enable SEGM channel 3 selection*/

/* IOC_SEGMTER0 */
#define IOC_SEGMTER0_EGM0TE0                    BIT(0)                                          /*!< EGM0 triggered system event flag at last time*/
#define IOC_SEGMTER0_EGM1TE0                    BIT(1)                                          /*!< EGM1 triggered system event flag at last time*/
#define IOC_SEGMTER0_EGM2TE0                    BIT(2)                                          /*!< EGM2 triggered system event flag at last time*/
#define IOC_SEGMTER0_EGM3TE0                    BIT(3)                                          /*!< EGM3 triggered system event flag at last time*/
#define IOC_SEGMTER0_EGM4TE0                    BIT(4)                                          /*!< EGM4 triggered system event flag at last time*/
#define IOC_SEGMTER0_EGM5TE0                    BIT(5)                                          /*!< EGM5 triggered system event flag at last time*/
#define IOC_SEGMTER0_EGM6TE0                    BIT(6)                                          /*!< EGM6 triggered system event flag at last time*/
#define IOC_SEGMTER0_EGM7TE0                    BIT(7)                                          /*!< EGM7 triggered system event flag at last time*/
#define IOC_SEGMTER0_EGM0TE1                    BIT(16)                                         /*!< EGM0 triggered system event flag before EGM*/
#define IOC_SEGMTER0_EGM1TE1                    BIT(17)                                         /*!< EGM1 triggered system event flag before EGM*/
#define IOC_SEGMTER0_EGM2TE1                    BIT(18)                                         /*!< EGM2 triggered system event flag before EGM*/
#define IOC_SEGMTER0_EGM3TE1                    BIT(19)                                         /*!< EGM3 triggered system event flag before EGM*/
#define IOC_SEGMTER0_EGM4TE1                    BIT(20)                                         /*!< EGM4 triggered system event flag before EGM*/
#define IOC_SEGMTER0_EGM5TE1                    BIT(21)                                         /*!< EGM5 triggered system event flag before EGM*/
#define IOC_SEGMTER0_EGM6TE1                    BIT(22)                                         /*!< EGM6 triggered system event flag before EGM*/
#define IOC_SEGMTER0_EGM7TE1                    BIT(23)                                         /*!< EGM7 triggered system event flag before EGM*/

