sorosaulong-ux/gd32-test-project/Library/gd32a7xx_ioc.h
/* IOC_SEGMTER1 */
#define IOC_SEGMTER1_EGM0TE2                    BIT(0)                                           /*!< EGM0 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM1TE2                    BIT(1)                                           /*!< EGM1 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM2TE2                    BIT(2)                                           /*!< EGM2 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM3TE2                    BIT(3)                                           /*!< EGM3 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM4TE2                    BIT(4)                                           /*!< EGM4 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM5TE2                    BIT(5)                                           /*!< EGM5 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM6TE2                    BIT(6)                                           /*!< EGM6 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM7TE2                    BIT(7)                                           /*!< EGM7 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM0TE3                    BIT(16)                                          /*!< EGM0 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM1TE3                    BIT(17)                                          /*!< EGM1 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM2TE3                    BIT(18)                                          /*!< EGM2 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM3TE3                    BIT(19)                                          /*!< EGM3 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM4TE3                    BIT(20)                                          /*!< EGM4 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM5TE3                    BIT(21)                                          /*!< EGM5 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM6TE3                    BIT(22)                                          /*!< EGM6 triggered system event flag before EGM*/
#define IOC_SEGMTER1_EGM7TE3                    BIT(23)                                          /*!< EGM7 triggered system event flag before EGM*/

/* IOC_TMRINTSTAT */
#define IOC_TMRINTSTAT_TMRERR_PSCIE             BIT(0)                                           /*!< TMRERR_PSC interrupt enable*/
#define IOC_TMRINTSTAT_TMRERR_PSCIF             BIT(1)                                           /*!< clock prescaler selection TMR rectify error alarm flag*/
#define IOC_TMRINTSTAT_TMRERR_CLKENIE           BIT(2)                                           /*!< TMREER_CLKEN interrupt enable*/
#define IOC_TMRINTSTAT_TMRERR_CLKENIF           BIT(3)                                           /*!< clock control enable TMR rectify error alarm flag*/
#define IOC_TMRINTSTAT_TMRERR_MCENIE            BIT(4)                                           /*!< TMRERR_MCEN interrupt enable*/
#define IOC_TMRINTSTAT_TMRERR_MCENIF            BIT(5)                                           /*!< module close enable TMR rectify error alarm flag*/

/* IOC_INTSTAT */
#define IOC_INTSTAT_ALRMIE                      BIT(0)                                           /*!< alarm interrupt enable*/
#define IOC_INTSTAT_ALRMIF                      BIT(1)                                           /*!< SEGM event trigger activity flag*/

/* constants definitions */

#define IOC_FPM_CHANNEL_NUM         8U
#define IOC_EGM_CHANNEL_NUM         8U
#define IOC_RSG_CHANNEL_NUM         8U
#define IOC_SEGM_CHANNEL_NUM        4U

/* FPM mode definition */
#define FPM_MODE(regval)                       (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define DLY_DEB_BOTH_EDGE                      FPM_MODE(0)                                       /*!< delayed debounce filter mode on both edges */
#define IMM_DEB_BOTH_EDGE                      FPM_MODE(1)                                       /*!< immediate debounce filter mode on both edges */
#define IMM_DEBE_R_EDGE                        FPM_MODE(2)                                       /*!< immediate debounce filter mode on rising edge, no filtering on falling edge */
#define IMM_DEBE_F_EDGE                        FPM_MODE(3)                                       /*!< no filtering on rising edge, immediate debounce filter mode on falling edge */
#define DLY_DEB_R_EDGE_IMM_DEB_F_EDGE          FPM_MODE(4)                                       /*!< delayed debounce filter mode on rising edge, immediate debounce filter mode on falling edge */
#define IMM_DEB_R_EDGE_DLY_DEB_F_EDGE          FPM_MODE(5)                                       /*!< immediate debounce filter mode on rising edge, delayed debounce filter mode on falling edge */
#define PRESCALER_R_EDGE                       FPM_MODE(6)                                       /*!< prescaler mode (triggered on rising edge) */
#define PRESCALER_F_EDGE                       FPM_MODE(7)                                       /*!< prescaler mode (triggered on falling edge) */

/* reference FPM input signal definiton */
#define REFERENCE_SIGNAL(regval)               (BITS(24,26) & ((uint32_t)(regval) << 24U))
#define FPM_SO_REF                             REFERENCE_SIGNAL(0)                               /*!< select FPMx_SO */
#define IOC_REFERENCE                          REFERENCE_SIGNAL(1)                               /*!< select IOC_reference[x] */
#define RSG_REFERENCE                          REFERENCE_SIGNAL(4)                               /*!< select RSG_reference[x] */

/* reference FPM input signal definiton */
#define MONITOR_SIGNAL(regval)                 (BITS(19,20) & ((uint32_t)(regval) << 19U))
#define FPM_SO_MON                             MONITOR_SIGNAL(0)                                 /*!< select FPMx_SO */
#define IOC_MONITOR                            MONITOR_SIGNAL(1)                                 /*!< select IOC_monitor[x] */

