sorosaulong-ux/gd32-test-project/Library/gd32a7xx_ioc.h
/* TRIGSEL input selection for RSG definiton */
#define RSG_TRIGSEL_INPUT0                     IOC_RICTL_TIEEN0                                  /*!< TRIGSEL input0 selection for RSG combiner */
#define RSG_TRIGSEL_INPUT1                     IOC_RICTL_TIEEN1                                  /*!< TRIGSEL input1 selection for RSG combiner */
#define RSG_TRIGSEL_INPUT2                     IOC_RICTL_TIEEN2                                  /*!< TRIGSEL input2 selection for RSG combiner */
#define RSG_TRIGSEL_INPUT3                     IOC_RICTL_TIEEN3                                  /*!< TRIGSEL input3 selection for RSG combiner */
#define RSG_TRIGSEL_INPUT4                     IOC_RICTL_TIEEN4                                  /*!< TRIGSEL input4 selection for RSG combiner */
#define RSG_TRIGSEL_INPUT5                     IOC_RICTL_TIEEN5                                  /*!< TRIGSEL input5 selection for RSG combiner */
#define RSG_TRIGSEL_INPUT6                     IOC_RICTL_TIEEN6                                  /*!< TRIGSEL input6 selection for RSG combiner */
#define RSG_TRIGSEL_INPUT7                     IOC_RICTL_TIEEN7                                  /*!< TRIGSEL input7 selection for RSG combiner */

/* EGM reference signal  definiton */
#define EGM_REFERENCE_SIGNAL(regval)           (BITS(20,22) & ((uint32_t)(regval) << 20))
#define REFERENCE0                             EGM_REFERENCE_SIGNAL(0)                           /*!< reference[0] */
#define REFERENCE1                             EGM_REFERENCE_SIGNAL(1)                           /*!< reference[1] */
#define REFERENCE2                             EGM_REFERENCE_SIGNAL(2)                           /*!< reference[2] */
#define REFERENCE3                             EGM_REFERENCE_SIGNAL(3)                           /*!< reference[3] */
#define REFERENCE4                             EGM_REFERENCE_SIGNAL(4)                           /*!< reference[4] */
#define REFERENCE5                             EGM_REFERENCE_SIGNAL(5)                           /*!< reference[5] */
#define REFERENCE6                             EGM_REFERENCE_SIGNAL(6)                           /*!< reference[6] */
#define REFERENCE7                             EGM_REFERENCE_SIGNAL(7)                           /*!< reference[7] */

/* EGM monitor signal definiton */
#define EGM_MONITORE_SIGNAL(regval)            (BITS(16,18) & ((uint32_t)(regval) << 16))
#define MONITOR0                               EGM_MONITORE_SIGNAL(0)                            /*!< monitor[0] */
#define MONITOR1                               EGM_MONITORE_SIGNAL(1)                            /*!< monitor[1] */
#define MONITOR2                               EGM_MONITORE_SIGNAL(2)                            /*!< monitor[2] */
#define MONITOR3                               EGM_MONITORE_SIGNAL(3)                            /*!< monitor[3] */
#define MONITOR4                               EGM_MONITORE_SIGNAL(4)                            /*!< monitor[4] */
#define MONITOR5                               EGM_MONITORE_SIGNAL(5)                            /*!< monitor[5] */
#define MONITOR6                               EGM_MONITORE_SIGNAL(6)                            /*!< monitor[6] */
#define MONITOR7                               EGM_MONITORE_SIGNAL(7)                            /*!< monitor[7] */

/* event window generation signal definiton */
#define EVENT_TRI_REFERENCE_SIGNAL             0U                                                /*!< reference signal */
#define EVENT_TRI_MONITOR_SIGNAL               IOC_EGMXCTL_EWGSIGS                               /*!< monitor signal */

/* EGM event window triger edge definiton */
#define EVENT_WIN_TRIGER_EDGE(regval)          (BITS(8,11) & ((uint32_t)(regval) << 8))
#define NO_EDGE_CLR_GATE                       EVENT_WIN_TRIGER_EDGE(0)                           /*!< neither edge used to clear event window counter. neither edge used to gate event generation */
#define REDGE_CLR                              EVENT_WIN_TRIGER_EDGE(1)                           /*!< rising edge used to clear event window counter. neither edge used to gate event generation */
#define FEDGE_CLR                              EVENT_WIN_TRIGER_EDGE(2)                           /*!< falling edge used to clear event window counter. neither edge used to gate event generation */
#define BOTH_EDGE_CLR                          EVENT_WIN_TRIGER_EDGE(3)                           /*!< both rising and falling edges used to clear event window counter. neither edge used to gate event generation */
#define REDGE_GATE                             EVENT_WIN_TRIGER_EDGE(4)                           /*!< neither edge used to clear event window counter. rising edge used to gate event generation */
#define REDGE_CLR_REDGE_GATE                   EVENT_WIN_TRIGER_EDGE(5)                           /*!< rising edge used to clear event window counter. rising edge used to gate event generation */
#define FEDGE_CLR_REDGE_GATE                   EVENT_WIN_TRIGER_EDGE(6)                           /*!< falling edge used to clear event window counter. rising edge used to gate event generation */
#define BOTH_EDGE_CLR_REDGE_GATE               EVENT_WIN_TRIGER_EDGE(7)                           /*!< both rising and falling edges used to clear event window counter. rising edge used to gate event generation */
#define FEDGE_GATE                             EVENT_WIN_TRIGER_EDGE(8)                           /*!< neither edge used to clear event window counter. falling edge used to gate event generation */
#define REDGE_CLR_FEDGE_GATE                   EVENT_WIN_TRIGER_EDGE(9)                           /*!< rising edge used to clear event window counter. falling edge used to gate event generation */
#define FEDGE_CLR_FEDGE_GATE                   EVENT_WIN_TRIGER_EDGE(10)                          /*!< Falling edge used to clear event window counter. Falling edge used to gate event generation */
#define BOTH_EDGE_CLR_FEDGE_GATE               EVENT_WIN_TRIGER_EDGE(11)                          /*!< both rising and falling edges used to clear event window counter. falling edge used to gate event generation */
#define BOTH_EDGE_GATE                         EVENT_WIN_TRIGER_EDGE(12)                          /*!< neither edge used to clear event window counter. both rising and falling edges used to gate event generation */
#define REDGE_CLR_BOTH_EDGE_GATE               EVENT_WIN_TRIGER_EDGE(13)                          /*!< rising edge used to clear event window counter. both rising and falling edges used to gate event generation */
#define FEDGE_CLR_BOTH_EDGE_GATE               EVENT_WIN_TRIGER_EDGE(14)                          /*!< falling edge used to clear event window counter. both rising and falling edges used to gate event generation */
#define BOTH_EDGE_CLR_GATE                     EVENT_WIN_TRIGER_EDGE(15)                          /*!< both rising and falling edges used to clear event window counter. both rising and falling edges used to gate event generation */

/* event window generation run mode definition */
#define FREE_RUNNING_MODE                      0U                                                /*!< free running mode */
#define GATE_MODE                              IOC_EGMXCTL_EWGRM                                 /*!< gated mode */

/* SEGM channel x event definition */
#define SEGM_EGM_EVENT(regval)                 (BITS(0,2) & (uint32_t)regval)
#define SEGM_EGM_EVENT0                        SEGM_EGM_EVENT(0)                                 /*!< EGM event 0 */
#define SEGM_EGM_EVENT1                        SEGM_EGM_EVENT(1)                                 /*!< EGM event 1 */
#define SEGM_EGM_EVENT2                        SEGM_EGM_EVENT(2)                                 /*!< EGM event 2 */
#define SEGM_EGM_EVENT3                        SEGM_EGM_EVENT(3)                                 /*!< EGM event 3 */
#define SEGM_EGM_EVENT4                        SEGM_EGM_EVENT(4)                                 /*!< EGM event 4 */
#define SEGM_EGM_EVENT5                        SEGM_EGM_EVENT(5)                                 /*!< EGM event 5 */
#define SEGM_EGM_EVENT6                        SEGM_EGM_EVENT(6)                                 /*!< EGM event 6 */
#define SEGM_EGM_EVENT7                        SEGM_EGM_EVENT(7)                                 /*!< EGM event 7 */

