sorosaulong-ux/gd32-test-project/Library/gd32a7xx_ioc.h
/* SEGM EGM_ETMx enable definition */
#define SEGM_EGM_EVENT0_ENABLE                 IOC_SEGMCTL1_EGM_ETM0EN                           /*!< enable EGM event 0 selection */
#define SEGM_EGM_EVENT1_ENABLE                 IOC_SEGMCTL1_EGM_ETM1EN                           /*!< enable EGM event 1 selection */
#define SEGM_EGM_EVENT2_ENABLE                 IOC_SEGMCTL1_EGM_ETM2EN                           /*!< enable EGM event 2 selection */
#define SEGM_EGM_EVENT3_ENABLE                 IOC_SEGMCTL1_EGM_ETM3EN                           /*!< enable EGM event 3 selection */
#define SEGM_EGM_EVENT4_ENABLE                 IOC_SEGMCTL1_EGM_ETM4EN                           /*!< enable EGM event 4 selection */
#define SEGM_EGM_EVENT5_ENABLE                 IOC_SEGMCTL1_EGM_ETM5EN                           /*!< enable EGM event 5 selection */
#define SEGM_EGM_EVENT6_ENABLE                 IOC_SEGMCTL1_EGM_ETM6EN                           /*!< enable EGM event 6 selection */
#define SEGM_EGM_EVENT7_ENABLE                 IOC_SEGMCTL1_EGM_ETM7EN                           /*!< enable EGM event 7 selection */

/* SEGM EGM_ETMx disable definition */
#define SEGM_EGM_EVENT0_DISABLE                ~IOC_SEGMCTL1_EGM_ETM0EN                          /*!< enable EGM event 0 selection */
#define SEGM_EGM_EVENT1_DISABLE                ~IOC_SEGMCTL1_EGM_ETM1EN                          /*!< enable EGM event 1 selection */
#define SEGM_EGM_EVENT2_DISABLE                ~IOC_SEGMCTL1_EGM_ETM2EN                          /*!< enable EGM event 2 selection */
#define SEGM_EGM_EVENT3_DISABLE                ~IOC_SEGMCTL1_EGM_ETM3EN                          /*!< enable EGM event 3 selection */
#define SEGM_EGM_EVENT4_DISABLE                ~IOC_SEGMCTL1_EGM_ETM4EN                          /*!< enable EGM event 4 selection */
#define SEGM_EGM_EVENT5_DISABLE                ~IOC_SEGMCTL1_EGM_ETM5EN                          /*!< enable EGM event 5 selection */
#define SEGM_EGM_EVENT6_DISABLE                ~IOC_SEGMCTL1_EGM_ETM6EN                          /*!< enable EGM event 6 selection */
#define SEGM_EGM_EVENT7_DISABLE                ~IOC_SEGMCTL1_EGM_ETM7EN                          /*!< enable EGM event 7 selection */

/* define the IOC bit position and its register index offset */
#define IOC_REGIDX_BIT(regidx, bitpos)     (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define IOC_REG_VAL(offset)                (REG32(IOC + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define IOC_BIT_POS(val)                   ((uint32_t)(val) & 0x0000001FU)
#define IOC_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                              | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define IOC_REG_VAL2(offset)               (REG32(IOC + ((uint32_t)(offset) >> 22)))
#define IOC_BIT_POS2(val)                  (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define IOC_SEGMTER0_REG_OFFSET                ((uint32_t)0x000000ECU)        /*!< IOC_SEGMTER0 register offset */
#define IOC_SEGMTER1_REG_OFFSET                ((uint32_t)0x000000F0U)        /*!< IOC_SEGMTER1 register offset */
#define IOC_TMRINTSTAT_REG_OFFSET              ((uint32_t)0x000000F4U)        /*!< IOC_TMRINTSTAT register offset */

typedef enum
{
    EGM0_TRIG_SYSTEM_EVENT_FLAG0 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 0),
    EGM1_TRIG_SYSTEM_EVENT_FLAG0 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 1),
    EGM2_TRIG_SYSTEM_EVENT_FLAG0 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 2),
    EGM3_TRIG_SYSTEM_EVENT_FLAG0 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 3),
    EGM4_TRIG_SYSTEM_EVENT_FLAG0 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 4),
    EGM5_TRIG_SYSTEM_EVENT_FLAG0 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 5),
    EGM6_TRIG_SYSTEM_EVENT_FLAG0 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 6),
    EGM7_TRIG_SYSTEM_EVENT_FLAG0 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 7),
    EGM0_TRIG_SYSTEM_EVENT_FLAG1 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 16),
    EGM1_TRIG_SYSTEM_EVENT_FLAG1 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 17),
    EGM2_TRIG_SYSTEM_EVENT_FLAG1 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 18),
    EGM3_TRIG_SYSTEM_EVENT_FLAG1 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 19),
    EGM4_TRIG_SYSTEM_EVENT_FLAG1 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 20),
    EGM5_TRIG_SYSTEM_EVENT_FLAG1 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 21),
    EGM6_TRIG_SYSTEM_EVENT_FLAG1 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 22),
    EGM7_TRIG_SYSTEM_EVENT_FLAG1 = IOC_REGIDX_BIT(IOC_SEGMTER0_REG_OFFSET, 23),
    EGM0_TRIG_SYSTEM_EVENT_FLAG2 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 0),
    EGM1_TRIG_SYSTEM_EVENT_FLAG2 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 1),
    EGM2_TRIG_SYSTEM_EVENT_FLAG2 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 2),
    EGM3_TRIG_SYSTEM_EVENT_FLAG2 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 3),
    EGM4_TRIG_SYSTEM_EVENT_FLAG2 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 4),
    EGM5_TRIG_SYSTEM_EVENT_FLAG2 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 5),
    EGM6_TRIG_SYSTEM_EVENT_FLAG2 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 6),
    EGM7_TRIG_SYSTEM_EVENT_FLAG2 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 7),
    EGM0_TRIG_SYSTEM_EVENT_FLAG3 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 16),
    EGM1_TRIG_SYSTEM_EVENT_FLAG3 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 17),
    EGM2_TRIG_SYSTEM_EVENT_FLAG3 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 18),
    EGM3_TRIG_SYSTEM_EVENT_FLAG3 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 19),
    EGM4_TRIG_SYSTEM_EVENT_FLAG3 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 20),
    EGM5_TRIG_SYSTEM_EVENT_FLAG3 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 21),
    EGM6_TRIG_SYSTEM_EVENT_FLAG3 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 22),
    EGM7_TRIG_SYSTEM_EVENT_FLAG3 = IOC_REGIDX_BIT(IOC_SEGMTER1_REG_OFFSET, 23)
} ioc_segm_generate_event_flag_enum;

typedef enum
{
    IOC_INT_TMRERR_PSC           = IOC_REGIDX_BIT(IOC_TMRINTSTAT_REG_OFFSET, 0),
    IOC_INT_TMRERR_CLKEN         = IOC_REGIDX_BIT(IOC_TMRINTSTAT_REG_OFFSET, 2),
    IOC_INT_TMRERR_MCEN          = IOC_REGIDX_BIT(IOC_TMRINTSTAT_REG_OFFSET, 4),
} ioc_tmr_interrupt_enum;

