sorosaulong-ux/gd32-test-project/Library/gd32a7xx_ioc.h
typedef enum
{
    IOC_FLAG_TMRERR_PSC      = IOC_REGIDX_BIT(IOC_TMRINTSTAT_REG_OFFSET, 1),
    IOC_FLAG_TMRERR_CLKEN    = IOC_REGIDX_BIT(IOC_TMRINTSTAT_REG_OFFSET, 3),
    IOC_FLAG_TMRERR_MCEN     = IOC_REGIDX_BIT(IOC_TMRINTSTAT_REG_OFFSET, 5),
} ioc_tmr_flag_enum;

typedef enum
{
    IOC_INT_FLAG_TMRERR_PSC      = IOC_REGIDX_BIT2(IOC_TMRINTSTAT_REG_OFFSET, 0, IOC_TMRINTSTAT_REG_OFFSET, 1),
    IOC_INT_FLAG_TMRERR_CLKEN    = IOC_REGIDX_BIT2(IOC_TMRINTSTAT_REG_OFFSET, 2, IOC_TMRINTSTAT_REG_OFFSET, 3),
    IOC_INT_FLAG_TMRERR_MCEN     = IOC_REGIDX_BIT2(IOC_TMRINTSTAT_REG_OFFSET, 4, IOC_TMRINTSTAT_REG_OFFSET, 5),
} ioc_tmr_interrupt_flag_enum;

typedef enum
{
    FPM_FLAG_FALLING_EDGE = 0U,
    FPM_FLAG_RISING_EDGE
} ioc_fpm_edge_stat_enum;

typedef enum
{
    IOC_FPM0 = 0U,
    IOC_FPM1,
    IOC_FPM2,
    IOC_FPM3,
    IOC_FPM4,
    IOC_FPM5,
    IOC_FPM6,
    IOC_FPM7
} ioc_fpmx_enum;

typedef enum
{
    IOC_EGM0 = 0U,
    IOC_EGM1,
    IOC_EGM2,
    IOC_EGM3,
    IOC_EGM4,
    IOC_EGM5,
    IOC_EGM6,
    IOC_EGM7
} ioc_egmx_enum;

typedef enum
{
    SEGM_CHANNEL_0 = 0U,
    SEGM_CHANNEL_1,
    SEGM_CHANNEL_2,
    SEGM_CHANNEL_3
} ioc_segm_channel_enum;

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

/* check FPM mode */
#define NOT_FPM_MODE(mode)                               (((mode) != DLY_DEB_BOTH_EDGE) && \
                                                          ((mode) != IMM_DEB_BOTH_EDGE) && \
                                                          ((mode) != IMM_DEBE_R_EDGE) && \
                                                          ((mode) != IMM_DEBE_F_EDGE) && \
                                                          ((mode) != DLY_DEB_R_EDGE_IMM_DEB_F_EDGE) && \
                                                          ((mode) != IMM_DEB_R_EDGE_DLY_DEB_F_EDGE) && \
                                                          ((mode) != PRESCALER_R_EDGE) && \
                                                          ((mode) != PRESCALER_F_EDGE))

/* check FPM reference input signal */
#define NOT_FPM_REF_INPUT_SIGNAL(signal)                 (((signal) != FPM_SO_REF) && \
                                                          ((signal) != IOC_REFERENCE) && \
                                                          ((signal) != RSG_REFERENCE))

/* check FPM monitor input signal */
#define NOT_FPM_MON_INPUT_SIGNAL(signal)                 (((signal) != FPM_SO_MON) && ((signal) != IOC_MONITOR))

/* check TRIGSEL input for RSG */
#define NOT_RSG_TRIGSEL_INPUT(signal)                    (((signal) != RSG_TRIGSEL_INPUT0) && \
                                                          ((signal) != RSG_TRIGSEL_INPUT1) && \
                                                          ((signal) != RSG_TRIGSEL_INPUT2) && \
                                                          ((signal) != RSG_TRIGSEL_INPUT3) && \
                                                          ((signal) != RSG_TRIGSEL_INPUT4) && \
                                                          ((signal) != RSG_TRIGSEL_INPUT5) && \
                                                          ((signal) != RSG_TRIGSEL_INPUT6) && \
                                                          ((signal) != RSG_TRIGSEL_INPUT7))

/* check EGM reference signal */
#define NOT_EGM_REFERENCE_SIGNAL(signal)                 (((signal) != REFERENCE0) && \
                                                          ((signal) != REFERENCE1) && \
                                                          ((signal) != REFERENCE2) && \
                                                          ((signal) != REFERENCE3) && \
                                                          ((signal) != REFERENCE4) && \
                                                          ((signal) != REFERENCE5) && \
                                                          ((signal) != REFERENCE6) && \
                                                          ((signal) != REFERENCE7))

/* check EGM monitor signal */
#define NOT_EGM_MONITOR_SIGNAL(signal)                   (((signal) != MONITOR0) && \
                                                          ((signal) != MONITOR1) && \
                                                          ((signal) != MONITOR2) && \
                                                          ((signal) != MONITOR3) && \
                                                          ((signal) != MONITOR4) && \
                                                          ((signal) != MONITOR5) && \
                                                          ((signal) != MONITOR6) && \
                                                          ((signal) != MONITOR7))

/* check event window generation signal */
#define NOT_EVENT_WIN_GENERATION_SIGNAL(signal)          (((signal) != EVENT_TRI_REFERENCE_SIGNAL) && ((signal) != EVENT_TRI_MONITOR_SIGNAL))

/* check EGM window triger edge */
#define NOT_EGM_EVENT_WIN_TRIGER(value)                  (((value) != NO_EDGE_CLR_GATE) && \
                                                          ((value) != REDGE_CLR) && \
                                                          ((value) != FEDGE_CLR) && \
                                                          ((value) != BOTH_EDGE_CLR) && \
                                                          ((value) != REDGE_GATE) && \
                                                          ((value) != REDGE_CLR_REDGE_GATE) && \
                                                          ((value) != FEDGE_CLR_REDGE_GATE) && \
                                                          ((value) != BOTH_EDGE_CLR_REDGE_GATE) && \
                                                          ((value) != FEDGE_GATE) && \
                                                          ((value) != REDGE_CLR_FEDGE_GATE) && \
                                                          ((value) != FEDGE_CLR_FEDGE_GATE) && \
                                                          ((value) != BOTH_EDGE_CLR_FEDGE_GATE) && \
                                                          ((value) != BOTH_EDGE_GATE) && \
                                                          ((value) != REDGE_CLR_BOTH_EDGE_GATE) && \
                                                          ((value) != FEDGE_CLR_BOTH_EDGE_GATE) && \
                                                          ((value) != BOTH_EDGE_CLR_GATE))

/* check event window generation run mode */
#define NOT_EVENT_WIN_RUN_MODE(mode)                     (((mode) != FREE_RUNNING_MODE) && ((mode) != GATE_MODE))

/* check clock prescaler */
#define EGM_EVENT_WIN_LOW_VALUE                          ((uint32_t)0x00000000U)        /*!< minimum threshold value */
#define EGM_EVENT_WIN_HIGH_VALUE                         ((uint32_t)0x00FFFFFFU)        /*!< maximum threshold value */
#define NOT_EGM_EVENT_WIN_VALUE(threshold)               (EGM_EVENT_WIN_HIGH_VALUE < (threshold))

/* check SEGM channel x event */
#define NOT_SEGM_EVENT(event)                            (((event) != SEGM_EGM_EVENT0) && \
                                                          ((event) != SEGM_EGM_EVENT1) && \
                                                          ((event) != SEGM_EGM_EVENT2) && \
                                                          ((event) != SEGM_EGM_EVENT3) && \
                                                          ((event) != SEGM_EGM_EVENT4) && \
                                                          ((event) != SEGM_EGM_EVENT5) && \
                                                          ((event) != SEGM_EGM_EVENT6) && \
                                                          ((event) != SEGM_EGM_EVENT7))

/* check SEGM Channel event counter threshold */
#define SEGM_EVENT_COUNTER_HIGH_VALUE                    ((uint32_t)0x0000000FU)        /*!< maximum threshold value */
#define NOT_SEGM_EVENT_COUNTER_VALUE(threshold)          (SEGM_EVENT_COUNTER_HIGH_VALUE < (threshold))

/* check SEGM EGM_EVENT enable */
#define NOT_SEGM_EGM_EVENT_ENABLE(event)                 (((event) != SEGM_EGM_EVENT0_ENABLE) && \
                                                          ((event) != SEGM_EGM_EVENT1_ENABLE) && \
                                                          ((event) != SEGM_EGM_EVENT2_ENABLE) && \
                                                          ((event) != SEGM_EGM_EVENT3_ENABLE) && \
                                                          ((event) != SEGM_EGM_EVENT4_ENABLE) && \
                                                          ((event) != SEGM_EGM_EVENT5_ENABLE) && \
                                                          ((event) != SEGM_EGM_EVENT6_ENABLE) && \
                                                          ((event) != SEGM_EGM_EVENT7_ENABLE))

/* check SEGM EGM_EVENT disable */
#define NOT_SEGM_EGM_EVENT_DISABLE(event)                (((event) != SEGM_EGM_EVENT0_DISABLE) && \
                                                          ((event) != SEGM_EGM_EVENT1_DISABLE) && \
                                                          ((event) != SEGM_EGM_EVENT2_DISABLE) && \
                                                          ((event) != SEGM_EGM_EVENT3_DISABLE) && \
                                                          ((event) != SEGM_EGM_EVENT4_DISABLE) && \
                                                          ((event) != SEGM_EGM_EVENT5_DISABLE) && \
                                                          ((event) != SEGM_EGM_EVENT6_DISABLE) && \
                                                          ((event) != SEGM_EGM_EVENT7_DISABLE))

/* check SEGM EGM_EVENT disable */
#define NOT_SEGM_SYSTEM_EVENT_FLAG(flag)                 (((flag) != EGM0_TRIG_SYSTEM_EVENT_FLAG0) && \
                                                          ((flag) != EGM1_TRIG_SYSTEM_EVENT_FLAG0) && \
                                                          ((flag) != EGM2_TRIG_SYSTEM_EVENT_FLAG0) && \
                                                          ((flag) != EGM3_TRIG_SYSTEM_EVENT_FLAG0) && \
                                                          ((flag) != EGM4_TRIG_SYSTEM_EVENT_FLAG0) && \
                                                          ((flag) != EGM5_TRIG_SYSTEM_EVENT_FLAG0) && \
                                                          ((flag) != EGM6_TRIG_SYSTEM_EVENT_FLAG0) && \
                                                          ((flag) != EGM7_TRIG_SYSTEM_EVENT_FLAG0) && \
                                                          ((flag) != EGM0_TRIG_SYSTEM_EVENT_FLAG1) && \
                                                          ((flag) != EGM1_TRIG_SYSTEM_EVENT_FLAG1) && \
                                                          ((flag) != EGM2_TRIG_SYSTEM_EVENT_FLAG1) && \
                                                          ((flag) != EGM3_TRIG_SYSTEM_EVENT_FLAG1) && \
                                                          ((flag) != EGM4_TRIG_SYSTEM_EVENT_FLAG1) && \
                                                          ((flag) != EGM5_TRIG_SYSTEM_EVENT_FLAG1) && \
                                                          ((flag) != EGM6_TRIG_SYSTEM_EVENT_FLAG1) && \
                                                          ((flag) != EGM7_TRIG_SYSTEM_EVENT_FLAG1) && \
                                                          ((flag) != EGM0_TRIG_SYSTEM_EVENT_FLAG2) && \
                                                          ((flag) != EGM1_TRIG_SYSTEM_EVENT_FLAG2) && \
                                                          ((flag) != EGM2_TRIG_SYSTEM_EVENT_FLAG2) && \
                                                          ((flag) != EGM3_TRIG_SYSTEM_EVENT_FLAG2) && \
                                                          ((flag) != EGM4_TRIG_SYSTEM_EVENT_FLAG2) && \
                                                          ((flag) != EGM5_TRIG_SYSTEM_EVENT_FLAG2) && \
                                                          ((flag) != EGM6_TRIG_SYSTEM_EVENT_FLAG2) && \
                                                          ((flag) != EGM7_TRIG_SYSTEM_EVENT_FLAG2) && \
                                                          ((flag) != EGM0_TRIG_SYSTEM_EVENT_FLAG3) && \
                                                          ((flag) != EGM1_TRIG_SYSTEM_EVENT_FLAG3) && \
                                                          ((flag) != EGM2_TRIG_SYSTEM_EVENT_FLAG3) && \
                                                          ((flag) != EGM3_TRIG_SYSTEM_EVENT_FLAG3) && \
                                                          ((flag) != EGM4_TRIG_SYSTEM_EVENT_FLAG3) && \
                                                          ((flag) != EGM5_TRIG_SYSTEM_EVENT_FLAG3) && \
                                                          ((flag) != EGM6_TRIG_SYSTEM_EVENT_FLAG3) && \
                                                          ((flag) != EGM7_TRIG_SYSTEM_EVENT_FLAG3))

/* check IOC IMR interrupt */
#define NOT_IOC_TMR_INTERRUPT(interrupt)                 (((interrupt) != IOC_INT_TMRERR_PSC) && \
                                                          ((interrupt) != IOC_INT_TMRERR_CLKEN) && \
                                                          ((interrupt) != IOC_INT_TMRERR_MCEN))

#define NOT_IOC_TMR_FLAG(flag)                           (((flag) != IOC_FLAG_TMRERR_PSC) && \
                                                          ((flag) != IOC_FLAG_TMRERR_CLKEN) && \
                                                          ((flag) != IOC_FLAG_TMRERR_MCEN))

#define NOT_IOC_TMR_INT_FLAG(int_flag)                   (((int_flag) != IOC_INT_FLAG_TMRERR_PSC) && \
                                                          ((int_flag) != IOC_INT_FLAG_TMRERR_CLKEN) && \
                                                          ((int_flag) != IOC_INT_FLAG_TMRERR_MCEN))

