sorosaulong-ux/gd32-test-project/Library/gd32a7xx_ioc.h
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */

/* enable IOC */
void ioc_enable(void);
/* disable IOC */
void ioc_disable(void);
/* reset IOC */
void ioc_reset(void);
/* get IOC enable flag */
FlagStatus ioc_enable_flag_get(void);
/* get IOC reset flag */
FlagStatus ioc_reset_flag_get(void);
/* clear IOC reset flag */
void ioc_reset_flag_clear(void);
/* enable IOC clock */
void ioc_clock_enable(void);
/* disable IOC clock */
void ioc_clock_disable(void);
/* configure IOC clock prescaler */
void ioc_prescaler_config(uint8_t psc);
/* configure IOC FPM mode */
void ioc_fpm_mode_config(ioc_fpmx_enum fpmx, uint32_t fpm_mode);
/* configure IOC FPM reference input signal selection */
void ioc_fpm_reference_signal_select(ioc_fpmx_enum fpmx, uint32_t input_signal);
/* configure IOC FPM monitor input signal selection */
void ioc_fpm_monitor_signal_select(ioc_fpmx_enum fpmx, uint32_t input_signal);
/* enable reset the counter of timer */
void ioc_fpm_timer_reset_enable(ioc_fpmx_enum fpmx);
/* disable reset the counter of timer, decrement the counter by one */
void ioc_fpm_timer_reset_disable(ioc_fpmx_enum fpmx);
/* configure the value of 16 bit comparator */
void ioc_fpm_cmp_config(ioc_fpmx_enum fpmx, uint16_t value);
/* get the value of reference signal FPM timer counter */
uint32_t ioc_rfpm_counter_get(ioc_fpmx_enum fpmx);
/* get the value of monitor signal FPM timer counter */
uint32_t ioc_mfpm_counter_get(ioc_fpmx_enum fpmx);
/* get reference signal FPM edge status */
FlagStatus ioc_rfpm_glitch_flag_get(ioc_fpmx_enum fpmx, ioc_fpm_edge_stat_enum edge_flag);
/* get monitor signal FPM edge status */
FlagStatus ioc_mfpm_glitch_flag_get(ioc_fpmx_enum fpmx, ioc_fpm_edge_stat_enum edge_flag);
/* clear reference signal FPM edge status */
void ioc_rfpm_glitch_flag_clear(ioc_fpmx_enum fpmx, ioc_fpm_edge_stat_enum edge_flag);
/* clear reference signal FPM edge status */
void ioc_mfpm_glitch_flag_clear(ioc_fpmx_enum fpmx, ioc_fpm_edge_stat_enum edge_flag);
/* enable TRIGSEL input selection for RSG combiner */
void ioc_rsg_input_enable(uint32_t trigsel_input);
/* disable TRIGSEL input selection for RSG combiner */
void ioc_rsg_input_disable(uint32_t trigsel_input);
/* select reference signal */
void ioc_egm_reference_signal_select(ioc_egmx_enum egmx, uint32_t ref_signal);
/* select monitor signal */
void ioc_egm_monitor_signal_select(ioc_egmx_enum egmx, uint32_t mon_signal);
/* enable invert reference signal */
void ioc_egm_reference_signal_invert_enable(ioc_egmx_enum egmx);
/* disable invert reference signal */
void ioc_egm_reference_signal_invert_disable(ioc_egmx_enum egmx);
/* enable invert monitor signal */
void ioc_egm_monitor_signal_invert_enable(ioc_egmx_enum egmx);
/* disable invert monitor signal */
void ioc_egm_monitor_signal_invert_disable(ioc_egmx_enum egmx);
/* slect event window generation signal */
void ioc_egm_event_window_signal_select(ioc_egmx_enum egmx, uint32_t signal);
/* elect event window triger edge */
void ioc_egm_event_window_triger_edge_select(ioc_egmx_enum egmx, uint32_t triger_edge);
/* enable event window inverted */
void ioc_egm_event_window_invert_enable(ioc_egmx_enum egmx);
/* disable event window inverted */
void ioc_egm_event_window_invert_disable(ioc_egmx_enum egmx);
/* enable events generated */
void ioc_egm_event_generate_enable(ioc_egmx_enum egmx);
/* disable events generated */
void ioc_egm_event_generate_disable(ioc_egmx_enum egmx);
/* configure event window generation run mode */
void ioc_egm_event_generate_mode_config(ioc_egmx_enum egmx, uint32_t mode);
/* enable monitor signal from the FPM compared with reference signal */
void ioc_egm_monitor_signal_compare_enable(ioc_egmx_enum egmx);
/* disable monitor signal from the FPM compared with reference signal, monitor signal is from monitor[x] */
void ioc_egm_monitor_signal_compare_disable(ioc_egmx_enum egmx);
/* configure event count threshold */
void ioc_egm_event_window_threshold_config(ioc_egmx_enum egmx, uint32_t threshold);
/* get the value of EGM event window counter */
uint32_t ioc_egm_event_window_counter_get(ioc_egmx_enum egmx);
/* get the overflow flag */
FlagStatus ioc_egm_counter_overflow_flag_get(ioc_egmx_enum egmx);
/* clear the overflow flag */
void ioc_egm_counter_overflow_flag_clear(ioc_egmx_enum egmx);
/* select SEGM channel event */
void ioc_segm_input_seclect(ioc_segm_channel_enum channel, uint32_t event);
/* select SEGM channel event */
void ioc_segm_counter_threshold_config(ioc_segm_channel_enum channel, uint32_t threshold);
/* enable EGM_EVENTx selection */
void ioc_segm_egm_event_enable(uint32_t egm_event);
/* disable EGM_ETMx selection */
void ioc_segm_egm_event_disable(uint32_t egm_event);
/* enable SEGM channel selection */
void ioc_segm_channel_enable(ioc_segm_channel_enum channel);
/* disable SEGM channel selection */
void ioc_segm_channel_disable(ioc_segm_channel_enum channel);
/* get SEGM system event recore flag */
FlagStatus ioc_segm_history_trigge_flag_get(ioc_segm_generate_event_flag_enum flag);
/* enable IOC TMR interrupt */
void ioc_tmr_interrupt_enable(ioc_tmr_interrupt_enum tmr_interrupt);
/* disable IOC TMR interrupt */
void ioc_tmr_interrupt_disable(ioc_tmr_interrupt_enum tmr_interrupt);
/* get IOC TMR flag */
FlagStatus ioc_tmr_flag_get(ioc_tmr_flag_enum tmr_flag);
/* clear IOC TMR flag */
void ioc_tmr_flag_clear(ioc_tmr_flag_enum tmr_flag);
/* get IOC TMR interrupt and flag status */
FlagStatus ioc_tmr_interrupt_flag_get(ioc_tmr_interrupt_flag_enum tmr_int_flag);
/* enable alarm interrupt */
void ioc_alarm_interrupt_enable(void);
/* disable alarm interrupt */
void ioc_alarm_interrupt_disable(void);
/* get SEGM event trigger flag */
FlagStatus ioc_segm_systerm_event_trigge_flag_get(void);
/* clear SEGM event trigger flag */
void ioc_segm_systerm_event_trigge_flag_clear(void);

#endif /* GD32A7XX_IOC_H */
